---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailMaterialsParam
source: html/12dd5cb3-14ff-1a3c-a408-67806afb3057.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailMaterialsParam Property

"Material"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailMaterialsParam { get; }
```